Autodesk.Revit.DB.Electrical.CapitalizationForLoadNames
Enumerated type listing the options for how electrical load names should be capitalized.
Since:
2012

Autodesk.Revit.DB.Electrical.CapitalizationForLoadNames.Upper
Capitalize all letters of every word in the load name.

Autodesk.Revit.DB.Electrical.CapitalizationForLoadNames.Sentence
Capitalize only the first letter of the first word in the load name.

Autodesk.Revit.DB.Electrical.CapitalizationForLoadNames.Initial
Capitalize the first letter of each word in the load name.

Autodesk.Revit.DB.Electrical.CapitalizationForLoadNames.SourceParameters
Use the capitalization formatting taken from the parameters that create the load name (Revit 2011 and previous).